WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Get the current status to determine why ISR called
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);
  uint8_t chanBits = mdwFreqTimerInfo->chanActiveBits;

  // bool inputState = stm32_gpioread(rcServoData->gpioInputConfig[0]);

  // if(rcServoData->inputPolarity1)
  //   inputState = !inputState;

  // if(inputState)
  // {
  //   // Leading edge
  //   rcServoData->timerLeadCnt1 = getreg16(timerInfo->timerBase + STM32_GTIM_CCR1_OFFSET);
  // }
  // else
  // {
  //   // Trailing edge
  // }

  //----------------------------------------------------------
  // Check Update Interrupt Flag. CNT changes, for this code, assume overflow
  if(timStatusReg & GTIM_SR_UIF)
  {
    // Need to verify if count is reset when edge is encountered.
    timStatusReg &= ~GTIM_SR_UIF;

    // CNT overflowed. This means we must add 1 to all active overflow values
    for(int i = 0; i < 4; i++)
    {
      if(chanBits & 0b00000001)
      {
        // Channel is active
        mdwFreqRtData_t *mdwFreqRtData = mdwFreqTimerInfo->mdwFreqRtData[i];
        mdwFreqRtData->leadToLeadOverflow++;
      }

      chanBits = chanBits >> 1;
      if(chanBits == 0)
        break;
    }
  }

  //----------------------------------------------------------
  // Channel 1
  if(timStatusReg & GTIM_SR_CC1IF)
  {
    timStatusReg &= ~GTIM_SR_CC1IF;

    mdwFreqRtData_t *mdwFreqRtData = 
              mdwFreqTimerInfo->mdwFreqRtData[FREQ_RT_DATA_OFFSET_CHAN_1];
    if(mdwFreqRtData == NULL)
    {
      syslog(1, "%s@%d-Channel 1-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
      return -ERROR;  // -1
    }

    // Save the capture/compare register snap shot for this channel
    uint32_t currentCount = 0;
    if(mdwFreqTimerInfo->timerWidth)
    {
      // 32-bit register
      currentCount = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);
      // Account for rollover
      if(mdwFreqRtData->previousCount > currentCount)
      {
        mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
      }
    }
    else
    {
      // 16-bit register
      currentCount = getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
      // Account for rollover
      if(mdwFreqRtData->previousCount > currentCount)
      {
        mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;
      }
    }

    mdwFreqRtData->leadToLeadCount = currentCount - mdwFreqRtData->previousCount;
    mdwFreqRtData->previousCount = currentCount;

    // Add current to total timer count for frequency average and
    // increment the GPIO input change count.
    mdwFreqRtData->timerTotalCount += mdwFreqRtData->leadToLeadCount;
    mdwFreqRtData->inputTotalCount++;
  }

  //----------------------------------------------------------
  // Channel 2
  if(timStatusReg & GTIM_SR_CC2IF)
  {
    timStatusReg &= ~GTIM_SR_CC2IF;

    // Only execute if channel is active
    if(chanBits & ACTIVE_CHAN_BITFIELD_2)
    {
        mdwFreqRtData_t *mdwFreqRtData = 
                  mdwFreqTimerInfo->mdwFreqRtData[FREQ_RT_DATA_OFFSET_CHAN_2];
        if(mdwFreqRtData == NULL)
        {
          syslog(1, "%s@%d-Channel 2-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
          return -ERROR;  // -1
        }

        // Save the capture/compare register snap shot for this channel
        uint32_t currentCount = 0;
        if(mdwFreqTimerInfo->timerWidth)
        {
          // 32-bit register
          currentCount = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);
          // Account for rollover
          if(mdwFreqRtData->previousCount > currentCount)
          {
            mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
          }
        }
        else
        {
          // 16-bit register
          currentCount = getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);
          // Account for rollover
          if(mdwFreqRtData->previousCount > currentCount)
          {
            mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;
          }
        }

        mdwFreqRtData->leadToLeadCount = currentCount - mdwFreqRtData->previousCount;
        mdwFreqRtData->previousCount = currentCount;

        // Add current to total timer count for frequency average and
        // increment the GPIO input change count.
        mdwFreqRtData->timerTotalCount += mdwFreqRtData->leadToLeadCount;
        mdwFreqRtData->inputTotalCount++;
    }
  }

  //----------------------------------------------------------
  // Channel 3
  if(timStatusReg & GTIM_SR_CC3IF)
  {
    timStatusReg &= ~GTIM_SR_CC3IF;

    // Only execute if channel is active
    if(chanBits & ACTIVE_CHAN_BITFIELD_3)
    {
        mdwFreqRtData_t *mdwFreqRtData = 
                  mdwFreqTimerInfo->mdwFreqRtData[FREQ_RT_DATA_OFFSET_CHAN_3];
        if(mdwFreqRtData == NULL)
        {
          syslog(1, "%s@%d-Channel 3-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
          return -ERROR;  // -1
        }

        // Save the capture/compare register snap shot for this channel
        uint32_t currentCount = 0;
        if(mdwFreqTimerInfo->timerWidth)
        {
          // 32-bit register
          currentCount = getreg32(timerBase + STM32_GTIM_CCR3_OFFSET);
          // Account for rollover
          if(mdwFreqRtData->previousCount > currentCount)
          {
            mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
          }
        }
        else
        {
          // 16-bit register
          currentCount = getreg16(timerBase + STM32_GTIM_CCR3_OFFSET);
          // Account for rollover
          if(mdwFreqRtData->previousCount > currentCount)
          {
            mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;
          }
        }

        mdwFreqRtData->leadToLeadCount = currentCount - mdwFreqRtData->previousCount;
        mdwFreqRtData->previousCount = currentCount;

        // Add current to total timer count for frequency average and
        // increment the GPIO input change count.
        mdwFreqRtData->timerTotalCount += mdwFreqRtData->leadToLeadCount;
        mdwFreqRtData->inputTotalCount++;
    }
  }

  //----------------------------------------------------------
  // Channel 4
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;

    // Only execute if channel is active
    if(chanBits & ACTIVE_CHAN_BITFIELD_4)
    {
        mdwFreqRtData_t *mdwFreqRtData = 
                  mdwFreqTimerInfo->mdwFreqRtData[FREQ_RT_DATA_OFFSET_CHAN_4];
        if(mdwFreqRtData == NULL)
        {
          syslog(1, "%s@%d-Channel 4-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
          return -ERROR;  // -1
        }

        // Save the capture/compare register snap shot for this channel
        uint32_t currentCount = 0;
        if(mdwFreqTimerInfo->timerWidth)
        {
          // 32-bit register
          currentCount = getreg32(timerBase + STM32_GTIM_CCR4_OFFSET);
          // Account for rollover
          if(mdwFreqRtData->previousCount > currentCount)
          {
            mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_32_BIT_OVERFLOW_COUNT;
          }
        }
        else
        {
          // 16-bit register
          currentCount = getreg16(timerBase + STM32_GTIM_CCR4_OFFSET);
          // Account for rollover
          if(mdwFreqRtData->previousCount > currentCount)
          {
            mdwFreqRtData->leadToLeadOverflow += MEADOW_FREQ_16_BIT_OVERFLOW_COUNT;
          }
        }

        mdwFreqRtData->leadToLeadCount = currentCount - mdwFreqRtData->previousCount;
        mdwFreqRtData->previousCount = currentCount;

        // Add current to total timer count for frequency average and
        // increment the GPIO input change count.
        mdwFreqRtData->timerTotalCount += mdwFreqRtData->leadToLeadCount;
        mdwFreqRtData->inputTotalCount++;
    }
  }

  // Clear the status register
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);

  return OK;
}

