WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // (--) Timer wide setting
  // The value put into the ARR is maximum allowed for the timer. Either
  // 32-bit or 16-bit ARR register.
  uint32_t maxARRValue = mdwFreqTimerInfo->timerWidth ==
            MEADOW_FREQ_TIMER_WIDTH_16 ? 0xffff : 0xffffffff;
  putreg32(maxARRValue, timerBase + STM32_GTIM_ARR_OFFSET);

  // (--) Timer wide setting
  uint16_t regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  regval |= GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

  // Enable the timer input capture for this channel (it was disabled earlier)
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  switch(inputTimerChan)
  {
    case 1:
      regVal16 |= GTIM_CCER_CC1E;
      break;
    case 2:
      regVal16 |= GTIM_CCER_CC2E;
      break;

    case 3:
      regVal16 |= GTIM_CCER_CC3E;
      break;

    case 4:
      regVal16 |= GTIM_CCER_CC4E;
      break;
  }
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

  // Clear all interrupt sources and set the ones we need in the DMA/Interrupt
  // enable register (DIER).
  // Note: Advanced timers 1 & 8 add ATIM_DIER_COMIE, ATIM_DIER_BIE and
  // ATIM_DIER_COMDE
  modifyreg16(timerBase + STM32_GTIM_DIER_OFFSET, 
          GTIM_DIER_TDE   | GTIM_DIER_CC4DE | GTIM_DIER_CC3DE | GTIM_DIER_CC2DE |
          GTIM_DIER_CC1DE | GTIM_DIER_UDE   | GTIM_DIER_TIE   | GTIM_DIER_CC4IE |
          GTIM_DIER_CC3IE | GTIM_DIER_CC2IE | GTIM_DIER_CC1IE | GTIM_DIER_UIE,
          dierBits);

  // All interrupts are handled by the same ISR code but called via a different
  // interrupt vector for each timer.
  ret = irq_attach(mdwFreqTimerInfo->timerIrqVec,
            meadow_measure_freq_isr,  // ISR address
            mdwFreqTimerInfo);        // Argument to ISR
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed, ret:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return ret;
  }

  // Get things ready
  mdwFreqTimerInfo->mdwFreqRtData[channelOffset]->activeState =
            MEADOW_FREQ_SYNC_STATE_ERROR;

  // Enable timer
  meadow_measure_freq_enable(timerBase);

  // Lastly enable IRQ
  up_enable_irq(mdwFreqTimerInfo->timerIrqVec);

  return OK;
}

//=============================================================
// Called to unconfigure a timer
int meadow_measure_freq_unconfigure(const uint32_t timerNumber)
{
  // mdwFreqTimerInfo_t *mdwFreqTimerInfo =
  //           meadow_measure_freq_chk_get_timer_info(timerNumber);

  // // Is this slot being used?
  // if(mdwFreqTimerInfo->mdwFreqRtData == NULL)
  // {
  //   syslog(LOG_ERR, "%s@%d-Can't unconfigure, this timer %lu not configured.\n",
  //             __FILE__, __LINE__, timerNumber);
  //   return -EBADSLT;    // Invalid slot
  // }

  // // Stop interrupts
  // up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

  // // Stop timer
  // meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

  // // Unconfigure GPIO
  // stm32_unconfiggpio(mdwFreqTimerInfo->mdwFreqRtData->inputConfig);

  // // Free runtime memory
  // free(mdwFreqTimerInfo->mdwFreqRtData);
  // mdwFreqTimerInfo->mdwFreqRtData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t
          *returnData)
{
  double frequency;
  double averageFreq;
  double totalTimerCount;
  double inputTotalCount;
  uint32_t singleFullCycle;

  // Just feed pulse train into appropriate GPIO
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(returnData->timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Couldn't get TimerInfo from timer number:%lu\n",
          __FILE__, __LINE__, returnData->timerNumber);
    return -1;
  }

  mdwFreqRtData_t *mdwFreqRtData =
            mdwFreqTimerInfo->mdwFreqRtData[returnData->timerChannel - 1];
  if(mdwFreqRtData == NULL)
  {
    syslog(1, "%s@%d-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
    return -ERROR;  // -1
  }

  // This would be nice if it was atomic, it kind of is. The values only change
  // in the ISR and in the ISR all processes wait till ISR completed.
  // To help preserve resolution, use floating point math .
  singleFullCycle = mdwFreqRtData->leadToLeadCount;
  totalTimerCount = (double)mdwFreqRtData->timerTotalCount;
  inputTotalCount = (double)mdwFreqRtData->inputTotalCount;

  syslog(1, "%s@%d-Snapshot count:%lu, timerTotal:%llu, inputTotal:%llu\n",
            __FILE__, __LINE__, singleFullCycle,
            mdwFreqRtData->timerTotalCount,
            mdwFreqRtData->inputTotalCount);

  // The frequency is the timer's clock divided by the cycle count.
  frequency = ((double)MEADOW_FREQ_CLOCK_FREQ) / ((double)singleFullCycle);

  // Average frequency since last read
  double averageCount = totalTimerCount / inputTotalCount;
  averageFreq = ((double)MEADOW_FREQ_CLOCK_FREQ) / averageCount;

  syslog(2, "In Code-Freq:%6.2fHz, AvgFreq:%6.2f, Count:%lu\n",
            frequency, averageFreq, (uint32_t)inputTotalCount);

  returnData->frequencyX1000  = (frequency * 1000.0);
  returnData->avgFreqX1000    = (averageFreq * 1000.0);
  returnData->inputTotalCount = (uint32_t)inputTotalCount;

  // Prevent counts from being reused
  mdwFreqRtData->leadToLeadCount    = 0;
  mdwFreqRtData->leadToLeadOverflow = 0;
  mdwFreqRtData->inputTotalCount    = 0;
  mdwFreqRtData->timerTotalCount    = 0;

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
